class Urls:
    MAIN_PAGE_URL = "https://qa-scooter.praktikum-services.ru/"
    ORDER_PAGE_URL = "https://qa-scooter.praktikum-services.ru/order"
    DZEN_URL = "https://dzen.ru/"


class FAQData:
    FAQ_ANSWERS = {
        0: "Сутки — 400 рублей. Оплата курьеру — наличными или картой.",
        1: "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.",
        2: "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.",
        3: "Только начиная с завтрашнего дня. Но скоро станем расторопнее.",
        4: "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.",
        5: "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.",
        6: "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.",
        7: "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    }


class OrderData:
    DATA_SET_1 = {
        "order_button": "top",
        "name": "Иван",
        "surname": "Иванов",
        "address": "Москва, улица Ленина, 1",
        "metro": "Черкизовская",
        "phone": "89991234567",
        "date": "30.10.2026",
        "rental_period": "сутки",
        "color": "black",
        "comment": "Позвонить за час"
    }

    DATA_SET_2 = {
        "order_button": "bottom",
        "name": "Анна",
        "surname": "Петрова",
        "address": "Москва, улица Пушкина, 10",
        "metro": "Сокольники",
        "phone": "89997654321",
        "date": "31.10.2026",
        "rental_period": "двое суток",
        "color": "grey",
        "comment": "Оставить у двери"
    }